import React from "react";
import { Modal } from "react-bootstrap";
import { _ } from "trans";

import { getLocale } from "utils";

const renderEnForSite = () => {
  return (
    <div className="policy-container">
      <p>
        At vteme.life, accessible from https://vteme.life, one of our main
        priorities is the privacy of our visitors. This Privacy Policy document
        contains types of information that is collected and recorded by
        vteme.life and how we use it.
      </p>

      <p>
        If you have additional questions or require more information about our
        Privacy Policy, do not hesitate to contact us.
      </p>

      <h2>Log Files</h2>

      <p>
        vteme.life follows a standard procedure of using log files. These files
        log visitors when they visit websites. All hosting companies do this and
        a part of hosting services' analytics. The information collected by log
        files include internet protocol (IP) addresses, browser type, Internet
        Service Provider (ISP), date and time stamp, referring/exit pages, and
        possibly the number of clicks. These are not linked to any information
        that is personally identifiable. The purpose of the information is for
        analyzing trends, administering the site, tracking users' movement on
        the website, and gathering demographic information.
      </p>

      <h2>Cookies and Web Beacons</h2>

      <p>
        Like any other website, vteme.life uses 'cookies'. These cookies are
        used to store information including visitors' preferences, and the pages
        on the website that the visitor accessed or visited. The information is
        used to optimize the users' experience by customizing our web page
        content based on visitors' browser type and/or other information.
      </p>

      <h2>Privacy Policies</h2>

      <p>
        You may consult this list to find the Privacy Policy for each of the
        advertising partners of vteme.life.
      </p>

      <p>
        Third-party ad servers or ad networks uses technologies like cookies,
        JavaScript, or Web Beacons that are used in their respective
        advertisements and links that appear on vteme.life, which are sent
        directly to users' browser. They automatically receive your IP address
        when this occurs. These technologies are used to measure the
        effectiveness of their advertising campaigns and/or to personalize the
        advertising content that you see on websites that you visit.
      </p>

      <p>
        Note that vteme.life has no access to or control over these cookies that
        are used by third-party advertisers.
      </p>

      <h2>Third Party Privacy Policies</h2>

      <p>
        vteme.life's Privacy Policy does not apply to other advertisers or
        websites. Thus, we are advising you to consult the respective Privacy
        Policies of these third-party ad servers for more detailed information.
        It may include their practices and instructions about how to opt-out of
        certain options. You may find a complete list of these Privacy Policies
        and their links here: Privacy Policy Links.
      </p>

      <p>
        You can choose to disable cookies through your individual browser
        options. To know more detailed information about cookie management with
        specific web browsers, it can be found at the browsers' respective
        websites. What Are Cookies?
      </p>

      <h2>Children's Information</h2>

      <p>
        Another part of our priority is adding protection for children while
        using the internet. We encourage parents and guardians to observe,
        participate in, and/or monitor and guide their online activity.
      </p>

      <p>
        vteme.life does not knowingly collect any Personal Identifiable
        Information from children under the age of 18. If you think that your
        child provided this kind of information on our website, we strongly
        encourage you to contact us immediately and we will do our best efforts
        to promptly remove such information from our records.
      </p>

      <h2>Online Privacy Policy Only</h2>

      <p>
        This Privacy Policy applies only to our online activities and is valid
        for visitors to our website with regards to the information that they
        shared and/or collect in vteme.life. This policy is not applicable to
        any information collected offline or via channels other than this
        website.
      </p>

      <h2>Consent</h2>

      <p>
        By using our website, you hereby consent to our Privacy Policy and agree
        to its Terms and Conditions.
      </p>
    </div>
  );
};

const renderRuForSite = () => {
  return (
    <div className="policy-container">
      <p>
        Настоящая Политика конфиденциальности персональных данных (далее –
        Политика конфиденциальности) действует в отношении всей информации,
        которую сайт <strong>vteme.life</strong>, (далее – VTeme) расположенный
        на доменном имени <strong>vteme.life</strong> (а также его субдоменах),
        может получить о Пользователе во время использования сайта vteme.life (а
        также его субдоменов), его программ и его продуктов.
      </p>

      <h2>1. Определение терминов</h2>

      <p>
        <strong>
          1.1 В настоящей Политике конфиденциальности используются следующие
          термины:
        </strong>
      </p>

      <p>
        1.1.1. «<strong>Администрация сайта</strong>» (далее – Администрация) –
        уполномоченные сотрудники на управление сайтом{" "}
        <strong>vteme.life</strong>, действующие от имени VTeme, которые
        организуют и (или) осуществляют обработку персональных данных, а также
        определяет цели обработки персональных данных, состав персональных
        данных, подлежащих обработке, действия (операции), совершаемые с
        персональными данными.
      </p>

      <p>
        1.1.2. «Персональные данные» - любая информация, относящаяся к прямо или
        косвенно определенному, или определяемому физическому лицу (субъекту
        персональных данных).
      </p>

      <p>
        1.1.3. «Обработка персональных данных» - любое действие (операция) или
        совокупность действий (операций), совершаемых с использованием средств
        автоматизации или без использования таких средств с персональными
        данными, включая сбор, запись, систематизацию, накопление, хранение,
        уточнение (обновление, изменение), извлечение, использование, передачу
        (распространение, предоставление, доступ), обезличивание, блокирование,
        удаление, уничтожение персональных данных.
      </p>

      <p>
        1.1.4. «Конфиденциальность персональных данных» - обязательное для
        соблюдения Оператором или иным получившим доступ к персональным данным
        лицом требование не допускать их распространения без согласия субъекта
        персональных данных или наличия иного законного основания.
      </p>

      <p>
        1.1.5. «Сайт <strong> vteme.life</strong>» - это совокупность связанных
        между собой веб-страниц, размещенных в сети Интернет по уникальному
        адресу (URL): <strong>vteme.life</strong>, а также его субдоменах.
      </p>

      <p>
        1.1.6. «Субдомены» - это страницы или совокупность страниц,
        расположенные на доменах третьего уровня, принадлежащие сайту
        vteme.life, а также другие временные страницы, внизу который указана
        контактная информация Администрации
      </p>

      <p>
        1.1.5. «Пользователь сайта <strong>vteme.life</strong> » (далее
        Пользователь) – лицо, имеющее доступ к сайту <strong>vteme.life</strong>
        , посредством сети Интернет и использующее информацию, материалы и
        продукты сайта <strong>vteme.life</strong>.
      </p>

      <p>
        1.1.7. «Cookies» — небольшой фрагмент данных, отправленный веб-сервером
        и хранимый на компьютере пользователя, который веб-клиент или
        веб-браузер каждый раз пересылает веб-серверу в HTTP-запросе при попытке
        открыть страницу соответствующего сайта.
      </p>

      <p>
        1.1.8. «IP-адрес» — уникальный сетевой адрес узла в компьютерной сети,
        через который Пользователь получает доступ на VTeme.
      </p>

      <p>
        1.1.9. «Товар » - продукт, который Пользователь заказывает на сайте и
        оплачивает через платёжные системы.
      </p>

      <h2>2. Общие положения</h2>
      <p>
        2.1. Использование сайта vteme.life Пользователем означает согласие с
        настоящей Политикой конфиденциальности и условиями обработки
        персональных данных Пользователя.
      </p>

      <p>
        2.2. В случае несогласия с условиями Политики конфиденциальности
        Пользователь должен прекратить использование сайта vteme.life .
      </p>

      <p>
        2.3. Настоящая Политика конфиденциальности применяется к сайту
        vteme.life. VTeme не контролирует и не несет ответственность за сайты
        третьих лиц, на которые Пользователь может перейти по ссылкам, доступным
        на сайте vteme.life.
      </p>

      <p>
        2.4. Администрация не проверяет достоверность персональных данных,
        предоставляемых Пользователем.
      </p>

      <h2>3. Предмет политики конфиденциальности</h2>

      <p>
        3.1. Настоящая Политика конфиденциальности устанавливает обязательства
        Администрации по неразглашению и обеспечению режима защиты
        конфиденциальности персональных данных, которые Пользователь
        предоставляет по запросу Администрации при регистрации на сайте
        vteme.life, при подписке на информационную e-mail рассылку или при
        оформлении заказа.
      </p>

      <p>
        3.2. Персональные данные, разрешённые к обработке в рамках настоящей
        Политики конфиденциальности, предоставляются Пользователем путём
        заполнения форм на сайте vteme.life и включают в себя следующую
        информацию:
        <br />
        3.2.1. фамилию, имя, отчество Пользователя;
        <br />
        3.2.2. контактный телефон Пользователя;
        <br />
        3.2.3. адрес электронной почты (e-mail)
        <br />
        3.2.4. место жительство Пользователя (при необходимости)
        <br />
        3.2.5. адрес доставки Товара (при необходимости) 3.2.6. фотографию (при
        необходимости).
      </p>

      <p>
        3.3. VTeme защищает Данные, которые автоматически передаются при
        посещении страниц:
        <br />
        - IP адрес;
        <br />
        - информация из cookies;
        <br />
        - информация о браузере <br />
        - время доступа;
        <br />- реферер (адрес предыдущей страницы).
      </p>

      <p>
        3.3.1. Отключение cookies может повлечь невозможность доступа к частям
        сайта https://vteme.life, требующим авторизации.
      </p>

      <p>
        3.3.2. VTeme осуществляет сбор статистики об IP-адресах своих
        посетителей. Данная информация используется с целью предотвращения,
        выявления и решения технических проблем.
      </p>
      <p>
        3.4. Любая иная персональная информация неоговоренная выше (история
        посещения, используемые браузеры, операционные системы и т.д.) подлежит
        надежному хранению и нераспространению, за исключением случаев,
        предусмотренных в п.п. 5.2. и 5.3. настоящей Политики
        конфиденциальности.
      </p>

      <h2>4. Цели сбора персональной информации пользователя</h2>

      <p>
        4.1. Персональные данные Пользователя Администрация может использовать в
        целях:
        <br />
        4.1.1. Идентификации Пользователя, зарегистрированного на сайте
        vteme.life для его дальнейшей авторизации, оформления заказа и других
        действий.
        <br />
        4.1.2. Предоставления Пользователю доступа к персонализированным данным
        сайта vteme.life.
        <br />
        4.1.3. Установления с Пользователем обратной связи, включая направление
        уведомлений, запросов, касающихся использования сайта vteme.life,
        оказания услуг и обработки запросов и заявок от Пользователя.
        <br />
        4.1.4. Определения места нахождения Пользователя для обеспечения
        безопасности, предотвращения мошенничества.
        <br />
        4.1.5. Подтверждения достоверности и полноты персональных данных,
        предоставленных Пользователем.
        <br />
        4.1.6. Создания учетной записи для использования частей сайта
        vteme.life, если Пользователь дал согласие на создание учетной записи.
        <br />
        4.1.7. Уведомления Пользователя по электронной почте.
        <br />
        4.1.8. Предоставления Пользователю эффективной технической поддержки при
        возникновении проблем, связанных с использованием сайта vteme.life.
        <br />
        4.1.9. Предоставления Пользователю с его согласия специальных
        предложений, информации о ценах, новостной рассылки и иных сведений от
        имени сайта vteme.life.
        <br />
        4.1.10. Осуществления рекламной деятельности с согласия Пользователя.
      </p>

      <h2>5. Способы и сроки обработки персональной информации</h2>

      <p>
        5.1. Обработка персональных данных Пользователя осуществляется без
        ограничения срока, любым законным способом, в том числе в информационных
        системах персональных данных с использованием средств автоматизации или
        без использования таких средств.
      </p>
      <p>
        5.2. Пользователь соглашается с тем, что Администрация вправе передавать
        персональные данные третьим лицам, в частности, курьерским службам,
        организациями почтовой связи (в том числе электронной), операторам
        электросвязи, исключительно в целях выполнения заказа Пользователя,
        оформленного на сайте vteme.life, включая доставку Товара, документации
        или e-mail сообщений.
      </p>
      <p>
        5.3. Персональные данные Пользователя могут быть переданы уполномоченным
        органам государственной власти Российской Федерации только по основаниям
        и в порядке, установленным законодательством Российской Федерации.
      </p>

      <p>
        5.4. При утрате или разглашении персональных данных Администрация вправе
        не информировать Пользователя об утрате или разглашении персональных
        данных.
      </p>
      <p>
        5.5. Администрация принимает необходимые организационные и технические
        меры для защиты персональной информации Пользователя от неправомерного
        или случайного доступа, уничтожения, изменения, блокирования,
        копирования, распространения, а также от иных неправомерных действий
        третьих лиц.
      </p>
      <p>
        5.6. Администрация совместно с Пользователем принимает все необходимые
        меры по предотвращению убытков или иных отрицательных последствий,
        вызванных утратой или разглашением персональных данных Пользователя.
      </p>

      <h2>6. Права и обязанности сторон</h2>

      <p>
        <strong>6.1. Пользователь вправе:</strong>
      </p>
      <p>
        6.1.1. Принимать свободное решение о предоставлении своих персональных
        данных, необходимых для использования сайта vteme.life, и давать
        согласие на их обработку.
      </p>

      <p>
        6.1.2. Обновить, дополнить предоставленную информацию о персональных
        данных в случае изменения данной информации.
      </p>

      <p>
        6.1.3. Пользователь имеет право на получение у Администрации информации,
        касающейся обработки его персональных данных, если такое право не
        ограничено в соответствии с федеральными законами. Пользователь вправе
        требовать от Администрации уточнения его персональных данных, их
        блокирования или уничтожения в случае, если персональные данные являются
        неполными, устаревшими, неточными, незаконно полученными или не являются
        необходимыми для заявленной цели обработки, а также принимать
        предусмотренные законом меры по защите своих прав.
      </p>

      <p>
        <strong>6.2. Администрация обязана:</strong>
      </p>
      <p>
        6.2.1. Использовать полученную информацию исключительно для целей,
        указанных в п. 4 настоящей Политики конфиденциальности.
      </p>

      <p>
        6.2.2. Обеспечить хранение конфиденциальной информации в тайне, не
        разглашать без предварительного письменного разрешения Пользователя, а
        также не осуществлять продажу, обмен, опубликование, либо разглашение
        иными возможными способами переданных персональных данных Пользователя,
        за исключением п.п. 5.2 и 5.3. настоящей Политики Конфиденциальности.
      </p>

      <p>
        6.2.3. Принимать меры предосторожности для защиты конфиденциальности
        персональных данных Пользователя согласно порядку, обычно используемого
        для защиты такого рода информации в существующем деловом обороте.
      </p>

      <p>
        6.2.4. Осуществить блокирование персональных данных, относящихся к
        соответствующему Пользователю, с момента обращения или запроса
        Пользователя, или его законного представителя либо уполномоченного
        органа по защите прав субъектов персональных данных на период проверки,
        в случае выявления недостоверных персональных данных или неправомерных
        действий.
      </p>

      <h2>7. Ответственность сторон</h2>
      <p>
        7.1. Администрация, не исполнившая свои обязательства, несёт
        ответственность за убытки, понесённые Пользователем в связи с
        неправомерным использованием персональных данных, в соответствии с
        законодательством Российской Федерации, за исключением случаев,
        предусмотренных п.п. 5.2., 5.3. и 7.2. настоящей Политики
        Конфиденциальности.
      </p>

      <p>
        7.2. В случае утраты или разглашения Конфиденциальной информации
        Администрация не несёт ответственность, если данная конфиденциальная
        информация:
        <br />
        7.2.1. Стала публичным достоянием до её утраты или разглашения.
        <br />
        7.2.2. Была получена от третьей стороны до момента её получения
        Администрацией Ресурса.
        <br />
        7.2.3. Была разглашена с согласия Пользователя.
      </p>

      <p>
        7.3. Пользователь несет полную ответственность за соблюдение требований
        законодательства РФ, в том числе законов о рекламе, о защите авторских и
        смежных прав, об охране товарных знаков и знаков обслуживания, но не
        ограничиваясь перечисленным, включая полную ответственность за
        содержание и форму материалов.
      </p>

      <p>
        7.4. Пользователь признает, что ответственность за любую информацию (в
        том числе, но не ограничиваясь: файлы с данными, тексты и т. д.), к
        которой он может иметь доступ как к части сайта vteme.life, несет лицо,
        предоставившее такую информацию.
      </p>

      <p>
        7.5. Пользователь соглашается, что информация, предоставленная ему как
        часть сайта vteme.life, может являться объектом интеллектуальной
        собственности, права на который защищены и принадлежат другим
        Пользователям, партнерам или рекламодателям, которые размещают такую
        информацию на сайте vteme.life. <br />
        Пользователь не вправе вносить изменения, передавать в аренду,
        передавать на условиях займа, продавать, распространять или создавать
        производные работы на основе такого Содержания (полностью или в части),
        за исключением случаев, когда такие действия были письменно прямо
        разрешены собственниками такого Содержания в соответствии с условиями
        отдельного соглашения.
      </p>

      <p>
        7.6. В отношение текстовых материалов (статей, публикаций, находящихся в
        свободном публичном доступе на сайте vteme.life) допускается их
        распространение при условии, что будет дана ссылка на VTeme.
      </p>

      <p>
        7.7. Администрация не несет ответственности перед Пользователем за любой
        убыток или ущерб, понесенный Пользователем в результате удаления, сбоя
        или невозможности сохранения какого-либо Содержания и иных
        коммуникационных данных, содержащихся на сайте vteme.life или
        передаваемых через него.
      </p>

      <p>
        7.8. Администрация не несет ответственности за любые прямые или
        косвенные убытки, произошедшие из-за: использования либо невозможности
        использования сайта, либо отдельных сервисов; несанкционированного
        доступа к коммуникациям Пользователя; заявления или поведение любого
        третьего лица на сайте.
      </p>

      <p>
        7.9. Администрация не несет ответственность за какую-либо информацию,
        размещенную пользователем на сайте vteme.life, включая, но не
        ограничиваясь: информацию, защищенную авторским правом, без прямого
        согласия владельца авторского права.
      </p>

      <h2>8. Разрешение споров</h2>

      <p>
        8.1. До обращения в суд с иском по спорам, возникающим из отношений
        между Пользователем и Администрацией, обязательным является предъявление
        претензии (письменного предложения или предложения в электронном виде о
        добровольном урегулировании спора).
      </p>

      <p>
        8.2. Получатель претензии в течение 30 календарных дней со дня получения
        претензии, письменно или в электронном виде уведомляет заявителя
        претензии о результатах рассмотрения претензии.
      </p>

      <p>
        8.3. При не достижении соглашения спор будет передан на рассмотрение
        Арбитражного суда г. Москва.
      </p>

      <p>
        8.4. К настоящей Политике конфиденциальности и отношениям между
        Пользователем и Администрацией применяется действующее законодательство
        Российской Федерации.
      </p>

      <h2>9. Дополнительные условия</h2>
      <p>
        9.1. Администрация вправе вносить изменения в настоящую Политику
        конфиденциальности без согласия Пользователя.
      </p>

      <p>
        9.2. Новая Политика конфиденциальности вступает в силу с момента ее
        размещения на сайте vteme.life, если иное не предусмотрено новой
        редакцией Политики конфиденциальности.
      </p>

      <p>
        9.3. Все предложения или вопросы касательно настоящей Политики
        конфиденциальности следует сообщать по адресу: team@vteme.life
      </p>

      <p>
        9.4. Действующая Политика конфиденциальности размещена на странице по
        адресу{" "}
        <a
          href="https://vteme.life/policy/"
          target="_blank"
          rel="noopener noreferrer"
        >
          https://vteme.life/policy/
        </a>
      </p>

      <p>Обновлено: 30 Ноября 2019 года</p>
      <p>г. Москва, </p>
    </div>
  );
};

export const SitePolicyModal: React.SFC<any> = props => {
  const locale = getLocale();
  const renderPrivacy = locale === "en" ? renderEnForSite : renderRuForSite;
  return (
    <Modal
      className="modal-comments"
      size="lg"
      show={props.show}
      onHide={props.onHide}
    >
      <Modal.Header closeButton={true}>
        <Modal.Title>{_("Privacy policy")}</Modal.Title>
      </Modal.Header>
      <Modal.Body>{renderPrivacy()}</Modal.Body>
    </Modal>
  );
};

export const SitePolicy: React.SFC<any> = props => {
  const locale = getLocale();
  const renderPrivacy = locale === "en" ? renderEnForSite : renderRuForSite;
  return (
    <div
      className="policy-page"
      style={{
        margin: "50px",
        marginTop: "100px"
      }}
    >
      <h1>{_("Privacy policy")}</h1>
      {renderPrivacy()}
    </div>
  );
};

export default SitePolicy;
